# ReinforcementAbbreviationTag Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReinforcementAbbreviationTag Class
Members See Also
---
This class is used to access the Area or Path Reinforcement abbreviation tag data. It stores abbreviation tag value and abbreviation type.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class ReinforcementAbbreviationTag : IDisposable
```

Visual Basic
---
```text
Public Class ReinforcementAbbreviationTag _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ReinforcementAbbreviationTag : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..ReinforcementAbbreviationTag
# See Also
ReinforcementAbbreviationTag Members
Autodesk.Revit.DB.Structure Namespace